---
kind: property
id: P:Autodesk.Revit.DB.GenericForm.Subcategory
source: html/6c43c9dd-4536-6803-87ca-a8eb76fbfa7d.htm
---
# Autodesk.Revit.DB.GenericForm.Subcategory Property

The subcategory.

## Syntax (C#)
```csharp
public Category Subcategory { get; set; }
```

## Remarks
The subcategory can be set to either the family category or one of its subcategories.